lisp/emoji-github.org
* GitHub Emoji
  GitHub has created a de facto standard for expressing emoji as an ASCII
  sequence, known as "shortcodes". These are English descriptions bookended by
  the =:= character, such as =:apple:= for 🍎.

