lisp/emoji-github.org
** For Emacs

   Massaged into [[file:/Applications/MacPorts/EmacsMac.app/Contents/Resources/lisp/progmodes/prog-mode.el.gz::(defvar-local prettify-symbols-alist nil][prettify-symbols-alist]] format:

   #+begin_src elisp :var data=emojis-data
     (pp
      (remove nil
              (mapcar (lambda (item)
                        (when-let* ((name (car item))
                                    (url (cadr item))
                                    (cp-str (when (string-match "https://.*/unicode/\\([^.]+\\)\\.png.*" url)
                                              (match-string 1 url)))
                                    (cp (mapcar (lambda (cp)
                                                  (string-to-number cp 16))
                                                (split-string cp-str "-"))))
                          (cons
                           (format ":%s:" name)
                           (cond ((= 1 (length cp))
                                  (car cp))
                                 (t (let (ret)
                                      ;; insert composition rules
                                      (dolist (c cp)
                                        (push c ret)
                                        (push '(Br . Bl) ret))
                                      (pop ret) ; remove last rule
                                      (reverse ret)))))))
                      data)))
   #+end_src

   #+RESULTS:
   #+begin_example
   ((":+1:" . 128077)
    (":-1:" . 128078)
    (":100:" . 128175)
    (":1234:" . 128290)
    (":1st_place_medal:" . 129351)
    (":2nd_place_medal:" . 129352)
    (":3rd_place_medal:" . 129353)
    (":8ball:" . 127921)
    (":a:" . 127344)
    (":ab:" . 127374)
    (":abc:" . 128292)
    (":abcd:" . 128289)
    (":accept:" . 127569)
    (":aerial_tramway:" . 128673)
    (":afghanistan:" 127462
     (Br . Bl)
     127467)
    (":airplane:" . 9992)
    (":aland_islands:" 127462
     (Br . Bl)
     127485)
    (":alarm_clock:" . 9200)
    (":albania:" 127462
     (Br . Bl)
     127473)
    (":alembic:" . 9879)
    (":algeria:" 127465
     (Br . Bl)
     127487)
    (":alien:" . 128125)
    (":ambulance:" . 128657)
    (":american_samoa:" 127462
     (Br . Bl)
     127480)
    (":amphora:" . 127994)
    (":anchor:" . 9875)
    (":andorra:" 127462
     (Br . Bl)
     127465)
    (":angel:" . 128124)
    (":anger:" . 128162)
    (":angola:" 127462
     (Br . Bl)
     127476)
    (":angry:" . 128544)
    (":anguilla:" 127462
     (Br . Bl)
     127470)
    (":anguished:" . 128551)
    (":ant:" . 128028)
    (":antarctica:" 127462
     (Br . Bl)
     127478)
    (":antigua_barbuda:" 127462
     (Br . Bl)
     127468)
    (":apple:" . 127822)
    (":aquarius:" . 9810)
    (":argentina:" 127462
     (Br . Bl)
     127479)
    (":aries:" . 9800)
    (":armenia:" 127462
     (Br . Bl)
     127474)
    (":arrow_backward:" . 9664)
    (":arrow_double_down:" . 9196)
    (":arrow_double_up:" . 9195)
    (":arrow_down:" . 11015)
    (":arrow_down_small:" . 128317)
    (":arrow_forward:" . 9654)
    (":arrow_heading_down:" . 10549)
    (":arrow_heading_up:" . 10548)
    (":arrow_left:" . 11013)
    (":arrow_lower_left:" . 8601)
    (":arrow_lower_right:" . 8600)
    (":arrow_right:" . 10145)
    (":arrow_right_hook:" . 8618)
    (":arrow_up:" . 11014)
    (":arrow_up_down:" . 8597)
    (":arrow_up_small:" . 128316)
    (":arrow_upper_left:" . 8598)
    (":arrow_upper_right:" . 8599)
    (":arrows_clockwise:" . 128259)
    (":arrows_counterclockwise:" . 128260)
    (":art:" . 127912)
    (":articulated_lorry:" . 128667)
    (":artificial_satellite:" . 128752)
    (":aruba:" 127462
     (Br . Bl)
     127484)
    (":asterisk:" 42
     (Br . Bl)
     8419)
    (":astonished:" . 128562)
    (":athletic_shoe:" . 128095)
    (":atm:" . 127975)
    (":atom_symbol:" . 9883)
    (":australia:" 127462
     (Br . Bl)
     127482)
    (":austria:" 127462
     (Br . Bl)
     127481)
    (":avocado:" . 129361)
    (":azerbaijan:" 127462
     (Br . Bl)
     127487)
    (":b:" . 127345)
    (":baby:" . 128118)
    (":baby_bottle:" . 127868)
    (":baby_chick:" . 128036)
    (":baby_symbol:" . 128700)
    (":back:" . 128281)
    (":bacon:" . 129363)
    (":badminton:" . 127992)
    (":baggage_claim:" . 128708)
    (":baguette_bread:" . 129366)
    (":bahamas:" 127463
     (Br . Bl)
     127480)
    (":bahrain:" 127463
     (Br . Bl)
     127469)
    (":balance_scale:" . 9878)
    (":balloon:" . 127880)
    (":ballot_box:" . 128499)
    (":ballot_box_with_check:" . 9745)
    (":bamboo:" . 127885)
    (":banana:" . 127820)
    (":bangbang:" . 8252)
    (":bangladesh:" 127463
     (Br . Bl)
     127465)
    (":bank:" . 127974)
    (":bar_chart:" . 128202)
    (":barbados:" 127463
     (Br . Bl)
     127463)
    (":barber:" . 128136)
    (":baseball:" . 9918)
    (":basketball:" . 127936)
    (":basketball_man:" . 9977)
    (":basketball_woman:" 9977
     (Br . Bl)
     9792)
    (":bat:" . 129415)
    (":bath:" . 128704)
    (":bathtub:" . 128705)
    (":battery:" . 128267)
    (":beach_umbrella:" . 127958)
    (":bear:" . 128059)
    (":bed:" . 128719)
    (":bee:" . 128029)
    (":beer:" . 127866)
    (":beers:" . 127867)
    (":beetle:" . 128030)
    (":beginner:" . 128304)
    (":belarus:" 127463
     (Br . Bl)
     127486)
    (":belgium:" 127463
     (Br . Bl)
     127466)
    (":belize:" 127463
     (Br . Bl)
     127487)
    (":bell:" . 128276)
    (":bellhop_bell:" . 128718)
    (":benin:" 127463
     (Br . Bl)
     127471)
    (":bento:" . 127857)
    (":bermuda:" 127463
     (Br . Bl)
     127474)
    (":bhutan:" 127463
     (Br . Bl)
     127481)
    (":bicyclist:" . 128692)
    (":bike:" . 128690)
    (":biking_man:" . 128692)
    (":biking_woman:" 128692
     (Br . Bl)
     9792)
    (":bikini:" . 128089)
    (":biohazard:" . 9763)
    (":bird:" . 128038)
    (":birthday:" . 127874)
    (":black_circle:" . 9899)
    (":black_flag:" . 127988)
    (":black_heart:" . 128420)
    (":black_joker:" . 127183)
    (":black_large_square:" . 11035)
    (":black_medium_small_square:" . 9726)
    (":black_medium_square:" . 9724)
    (":black_nib:" . 10002)
    (":black_small_square:" . 9642)
    (":black_square_button:" . 128306)
    (":blonde_man:" . 128113)
    (":blonde_woman:" 128113
     (Br . Bl)
     9792)
    (":blossom:" . 127804)
    (":blowfish:" . 128033)
    (":blue_book:" . 128216)
    (":blue_car:" . 128665)
    (":blue_heart:" . 128153)
    (":blush:" . 128522)
    (":boar:" . 128023)
    (":boat:" . 9973)
    (":bolivia:" 127463
     (Br . Bl)
     127476)
    (":bomb:" . 128163)
    (":book:" . 128214)
    (":bookmark:" . 128278)
    (":bookmark_tabs:" . 128209)
    (":books:" . 128218)
    (":boom:" . 128165)
    (":boot:" . 128098)
    (":bosnia_herzegovina:" 127463
     (Br . Bl)
     127462)
    (":botswana:" 127463
     (Br . Bl)
     127484)
    (":bouquet:" . 128144)
    (":bow:" . 128583)
    (":bow_and_arrow:" . 127993)
    (":bowing_man:" . 128583)
    (":bowing_woman:" 128583
     (Br . Bl)
     9792)
    (":bowling:" . 127923)
    (":boxing_glove:" . 129354)
    (":boy:" . 128102)
    (":brazil:" 127463
     (Br . Bl)
     127479)
    (":bread:" . 127838)
    (":bride_with_veil:" . 128112)
    (":bridge_at_night:" . 127753)
    (":briefcase:" . 128188)
    (":british_indian_ocean_territory:" 127470
     (Br . Bl)
     127476)
    (":british_virgin_islands:" 127483
     (Br . Bl)
     127468)
    (":broken_heart:" . 128148)
    (":brunei:" 127463
     (Br . Bl)
     127475)
    (":bug:" . 128027)
    (":building_construction:" . 127959)
    (":bulb:" . 128161)
    (":bulgaria:" 127463
     (Br . Bl)
     127468)
    (":bullettrain_front:" . 128645)
    (":bullettrain_side:" . 128644)
    (":burkina_faso:" 127463
     (Br . Bl)
     127467)
    (":burrito:" . 127791)
    (":burundi:" 127463
     (Br . Bl)
     127470)
    (":bus:" . 128652)
    (":business_suit_levitating:" . 128372)
    (":busstop:" . 128655)
    (":bust_in_silhouette:" . 128100)
    (":busts_in_silhouette:" . 128101)
    (":butterfly:" . 129419)
    (":cactus:" . 127797)
    (":cake:" . 127856)
    (":calendar:" . 128198)
    (":call_me_hand:" . 129305)
    (":calling:" . 128242)
    (":cambodia:" 127472
     (Br . Bl)
     127469)
    (":camel:" . 128043)
    (":camera:" . 128247)
    (":camera_flash:" . 128248)
    (":cameroon:" 127464
     (Br . Bl)
     127474)
    (":camping:" . 127957)
    (":canada:" 127464
     (Br . Bl)
     127462)
    (":canary_islands:" 127470
     (Br . Bl)
     127464)
    (":cancer:" . 9803)
    (":candle:" . 128367)
    (":candy:" . 127852)
    (":canoe:" . 128758)
    (":cape_verde:" 127464
     (Br . Bl)
     127483)
    (":capital_abcd:" . 128288)
    (":capricorn:" . 9809)
    (":car:" . 128663)
    (":card_file_box:" . 128451)
    (":card_index:" . 128199)
    (":card_index_dividers:" . 128450)
    (":caribbean_netherlands:" 127463
     (Br . Bl)
     127478)
    (":carousel_horse:" . 127904)
    (":carrot:" . 129365)
    (":cat:" . 128049)
    (":cat2:" . 128008)
    (":cayman_islands:" 127472
     (Br . Bl)
     127486)
    (":cd:" . 128191)
    (":central_african_republic:" 127464
     (Br . Bl)
     127467)
    (":chad:" 127481
     (Br . Bl)
     127465)
    (":chains:" . 9939)
    (":champagne:" . 127870)
    (":chart:" . 128185)
    (":chart_with_downwards_trend:" . 128201)
    (":chart_with_upwards_trend:" . 128200)
    (":checkered_flag:" . 127937)
    (":cheese:" . 129472)
    (":cherries:" . 127826)
    (":cherry_blossom:" . 127800)
    (":chestnut:" . 127792)
    (":chicken:" . 128020)
    (":children_crossing:" . 128696)
    (":chile:" 127464
     (Br . Bl)
     127473)
    (":chipmunk:" . 128063)
    (":chocolate_bar:" . 127851)
    (":christmas_island:" 127464
     (Br . Bl)
     127485)
    (":christmas_tree:" . 127876)
    (":church:" . 9962)
    (":cinema:" . 127910)
    (":circus_tent:" . 127914)
    (":city_sunrise:" . 127751)
    (":city_sunset:" . 127750)
    (":cityscape:" . 127961)
    (":cl:" . 127377)
    (":clamp:" . 128476)
    (":clap:" . 128079)
    (":clapper:" . 127916)
    (":classical_building:" . 127963)
    (":clinking_glasses:" . 129346)
    (":clipboard:" . 128203)
    (":clock1:" . 128336)
    (":clock10:" . 128345)
    (":clock1030:" . 128357)
    (":clock11:" . 128346)
    (":clock1130:" . 128358)
    (":clock12:" . 128347)
    (":clock1230:" . 128359)
    (":clock130:" . 128348)
    (":clock2:" . 128337)
    (":clock230:" . 128349)
    (":clock3:" . 128338)
    (":clock330:" . 128350)
    (":clock4:" . 128339)
    (":clock430:" . 128351)
    (":clock5:" . 128340)
    (":clock530:" . 128352)
    (":clock6:" . 128341)
    (":clock630:" . 128353)
    (":clock7:" . 128342)
    (":clock730:" . 128354)
    (":clock8:" . 128343)
    (":clock830:" . 128355)
    (":clock9:" . 128344)
    (":clock930:" . 128356)
    (":closed_book:" . 128213)
    (":closed_lock_with_key:" . 128272)
    (":closed_umbrella:" . 127746)
    (":cloud:" . 9729)
    (":cloud_with_lightning:" . 127785)
    (":cloud_with_lightning_and_rain:" . 9928)
    (":cloud_with_rain:" . 127783)
    (":cloud_with_snow:" . 127784)
    (":clown_face:" . 129313)
    (":clubs:" . 9827)
    (":cn:" 127464
     (Br . Bl)
     127475)
    (":cocktail:" . 127864)
    (":cocos_islands:" 127464
     (Br . Bl)
     127464)
    (":coffee:" . 9749)
    (":coffin:" . 9904)
    (":cold_sweat:" . 128560)
    (":collision:" . 128165)
    (":colombia:" 127464
     (Br . Bl)
     127476)
    (":comet:" . 9732)
    (":comoros:" 127472
     (Br . Bl)
     127474)
    (":computer:" . 128187)
    (":computer_mouse:" . 128433)
    (":confetti_ball:" . 127882)
    (":confounded:" . 128534)
    (":confused:" . 128533)
    (":congo_brazzaville:" 127464
     (Br . Bl)
     127468)
    (":congo_kinshasa:" 127464
     (Br . Bl)
     127465)
    (":congratulations:" . 12951)
    (":construction:" . 128679)
    (":construction_worker:" . 128119)
    (":construction_worker_man:" . 128119)
    (":construction_worker_woman:" 128119
     (Br . Bl)
     9792)
    (":control_knobs:" . 127899)
    (":convenience_store:" . 127978)
    (":cook_islands:" 127464
     (Br . Bl)
     127472)
    (":cookie:" . 127850)
    (":cool:" . 127378)
    (":cop:" . 128110)
    (":copyright:" . 169)
    (":corn:" . 127805)
    (":costa_rica:" 127464
     (Br . Bl)
     127479)
    (":cote_divoire:" 127464
     (Br . Bl)
     127470)
    (":couch_and_lamp:" . 128715)
    (":couple:" . 128107)
    (":couple_with_heart:" . 128145)
    (":couple_with_heart_man_man:" 128104
     (Br . Bl)
     10084
     (Br . Bl)
     128104)
    (":couple_with_heart_woman_man:" . 128145)
    (":couple_with_heart_woman_woman:" 128105
     (Br . Bl)
     10084
     (Br . Bl)
     128105)
    (":couplekiss_man_man:" 128104
     (Br . Bl)
     10084
     (Br . Bl)
     128139
     (Br . Bl)
     128104)
    (":couplekiss_man_woman:" . 128143)
    (":couplekiss_woman_woman:" 128105
     (Br . Bl)
     10084
     (Br . Bl)
     128139
     (Br . Bl)
     128105)
    (":cow:" . 128046)
    (":cow2:" . 128004)
    (":cowboy_hat_face:" . 129312)
    (":crab:" . 129408)
    (":crayon:" . 128397)
    (":credit_card:" . 128179)
    (":crescent_moon:" . 127769)
    (":cricket:" . 127951)
    (":croatia:" 127469
     (Br . Bl)
     127479)
    (":crocodile:" . 128010)
    (":croissant:" . 129360)
    (":crossed_fingers:" . 129310)
    (":crossed_flags:" . 127884)
    (":crossed_swords:" . 9876)
    (":crown:" . 128081)
    (":cry:" . 128546)
    (":crying_cat_face:" . 128575)
    (":crystal_ball:" . 128302)
    (":cuba:" 127464
     (Br . Bl)
     127482)
    (":cucumber:" . 129362)
    (":cupid:" . 128152)
    (":curacao:" 127464
     (Br . Bl)
     127484)
    (":curly_loop:" . 10160)
    (":currency_exchange:" . 128177)
    (":curry:" . 127835)
    (":custard:" . 127854)
    (":customs:" . 128707)
    (":cyclone:" . 127744)
    (":cyprus:" 127464
     (Br . Bl)
     127486)
    (":czech_republic:" 127464
     (Br . Bl)
     127487)
    (":dagger:" . 128481)
    (":dancer:" . 128131)
    (":dancers:" . 128111)
    (":dancing_men:" 128111
     (Br . Bl)
     9794)
    (":dancing_women:" . 128111)
    (":dango:" . 127841)
    (":dark_sunglasses:" . 128374)
    (":dart:" . 127919)
    (":dash:" . 128168)
    (":date:" . 128197)
    (":de:" 127465
     (Br . Bl)
     127466)
    (":deciduous_tree:" . 127795)
    (":deer:" . 129420)
    (":denmark:" 127465
     (Br . Bl)
     127472)
    (":department_store:" . 127980)
    (":derelict_house:" . 127962)
    (":desert:" . 127964)
    (":desert_island:" . 127965)
    (":desktop_computer:" . 128421)
    (":detective:" . 128373)
    (":diamond_shape_with_a_dot_inside:" . 128160)
    (":diamonds:" . 9830)
    (":disappointed:" . 128542)
    (":disappointed_relieved:" . 128549)
    (":dizzy:" . 128171)
    (":dizzy_face:" . 128565)
    (":djibouti:" 127465
     (Br . Bl)
     127471)
    (":do_not_litter:" . 128687)
    (":dog:" . 128054)
    (":dog2:" . 128021)
    (":dollar:" . 128181)
    (":dolls:" . 127886)
    (":dolphin:" . 128044)
    (":dominica:" 127465
     (Br . Bl)
     127474)
    (":dominican_republic:" 127465
     (Br . Bl)
     127476)
    (":door:" . 128682)
    (":doughnut:" . 127849)
    (":dove:" . 128330)
    (":dragon:" . 128009)
    (":dragon_face:" . 128050)
    (":dress:" . 128087)
    (":dromedary_camel:" . 128042)
    (":drooling_face:" . 129316)
    (":droplet:" . 128167)
    (":drum:" . 129345)
    (":duck:" . 129414)
    (":dvd:" . 128192)
    (":e-mail:" . 128231)
    (":eagle:" . 129413)
    (":ear:" . 128066)
    (":ear_of_rice:" . 127806)
    (":earth_africa:" . 127757)
    (":earth_americas:" . 127758)
    (":earth_asia:" . 127759)
    (":ecuador:" 127466
     (Br . Bl)
     127464)
    (":egg:" . 129370)
    (":eggplant:" . 127814)
    (":egypt:" 127466
     (Br . Bl)
     127468)
    (":eight:" 56
     (Br . Bl)
     8419)
    (":eight_pointed_black_star:" . 10036)
    (":eight_spoked_asterisk:" . 10035)
    (":el_salvador:" 127480
     (Br . Bl)
     127483)
    (":electric_plug:" . 128268)
    (":elephant:" . 128024)
    (":email:" . 9993)
    (":end:" . 128282)
    (":envelope:" . 9993)
    (":envelope_with_arrow:" . 128233)
    (":equatorial_guinea:" 127468
     (Br . Bl)
     127478)
    (":eritrea:" 127466
     (Br . Bl)
     127479)
    (":es:" 127466
     (Br . Bl)
     127480)
    (":estonia:" 127466
     (Br . Bl)
     127466)
    (":ethiopia:" 127466
     (Br . Bl)
     127481)
    (":eu:" 127466
     (Br . Bl)
     127482)
    (":euro:" . 128182)
    (":european_castle:" . 127984)
    (":european_post_office:" . 127972)
    (":european_union:" 127466
     (Br . Bl)
     127482)
    (":evergreen_tree:" . 127794)
    (":exclamation:" . 10071)
    (":expressionless:" . 128529)
    (":eye:" . 128065)
    (":eye_speech_bubble:" 128065
     (Br . Bl)
     128488)
    (":eyeglasses:" . 128083)
    (":eyes:" . 128064)
    (":face_with_head_bandage:" . 129301)
    (":face_with_thermometer:" . 129298)
    (":facepunch:" . 128074)
    (":factory:" . 127981)
    (":falkland_islands:" 127467
     (Br . Bl)
     127472)
    (":fallen_leaf:" . 127810)
    (":family:" . 128106)
    (":family_man_boy:" 128104
     (Br . Bl)
     128102)
    (":family_man_boy_boy:" 128104
     (Br . Bl)
     128102
     (Br . Bl)
     128102)
    (":family_man_girl:" 128104
     (Br . Bl)
     128103)
    (":family_man_girl_boy:" 128104
     (Br . Bl)
     128103
     (Br . Bl)
     128102)
    (":family_man_girl_girl:" 128104
     (Br . Bl)
     128103
     (Br . Bl)
     128103)
    (":family_man_man_boy:" 128104
     (Br . Bl)
     128104
     (Br . Bl)
     128102)
    (":family_man_man_boy_boy:" 128104
     (Br . Bl)
     128104
     (Br . Bl)
     128102
     (Br . Bl)
     128102)
    (":family_man_man_girl:" 128104
     (Br . Bl)
     128104
     (Br . Bl)
     128103)
    (":family_man_man_girl_boy:" 128104
     (Br . Bl)
     128104
     (Br . Bl)
     128103
     (Br . Bl)
     128102)
    (":family_man_man_girl_girl:" 128104
     (Br . Bl)
     128104
     (Br . Bl)
     128103
     (Br . Bl)
     128103)
    (":family_man_woman_boy:" . 128106)
    (":family_man_woman_boy_boy:" 128104
     (Br . Bl)
     128105
     (Br . Bl)
     128102
     (Br . Bl)
     128102)
    (":family_man_woman_girl:" 128104
     (Br . Bl)
     128105
     (Br . Bl)
     128103)
    (":family_man_woman_girl_boy:" 128104
     (Br . Bl)
     128105
     (Br . Bl)
     128103
     (Br . Bl)
     128102)
    (":family_man_woman_girl_girl:" 128104
     (Br . Bl)
     128105
     (Br . Bl)
     128103
     (Br . Bl)
     128103)
    (":family_woman_boy:" 128105
     (Br . Bl)
     128102)
    (":family_woman_boy_boy:" 128105
     (Br . Bl)
     128102
     (Br . Bl)
     128102)
    (":family_woman_girl:" 128105
     (Br . Bl)
     128103)
    (":family_woman_girl_boy:" 128105
     (Br . Bl)
     128103
     (Br . Bl)
     128102)
    (":family_woman_girl_girl:" 128105
     (Br . Bl)
     128103
     (Br . Bl)
     128103)
    (":family_woman_woman_boy:" 128105
     (Br . Bl)
     128105
     (Br . Bl)
     128102)
    (":family_woman_woman_boy_boy:" 128105
     (Br . Bl)
     128105
     (Br . Bl)
     128102
     (Br . Bl)
     128102)
    (":family_woman_woman_girl:" 128105
     (Br . Bl)
     128105
     (Br . Bl)
     128103)
    (":family_woman_woman_girl_boy:" 128105
     (Br . Bl)
     128105
     (Br . Bl)
     128103
     (Br . Bl)
     128102)
    (":family_woman_woman_girl_girl:" 128105
     (Br . Bl)
     128105
     (Br . Bl)
     128103
     (Br . Bl)
     128103)
    (":faroe_islands:" 127467
     (Br . Bl)
     127476)
    (":fast_forward:" . 9193)
    (":fax:" . 128224)
    (":fearful:" . 128552)
    (":feet:" . 128062)
    (":female_detective:" 128373
     (Br . Bl)
     9792)
    (":ferris_wheel:" . 127905)
    (":ferry:" . 9972)
    (":field_hockey:" . 127953)
    (":fiji:" 127467
     (Br . Bl)
     127471)
    (":file_cabinet:" . 128452)
    (":file_folder:" . 128193)
    (":film_projector:" . 128253)
    (":film_strip:" . 127902)
    (":finland:" 127467
     (Br . Bl)
     127470)
    (":fire:" . 128293)
    (":fire_engine:" . 128658)
    (":fireworks:" . 127878)
    (":first_quarter_moon:" . 127763)
    (":first_quarter_moon_with_face:" . 127771)
    (":fish:" . 128031)
    (":fish_cake:" . 127845)
    (":fishing_pole_and_fish:" . 127907)
    (":fist:" . 9994)
    (":fist_left:" . 129307)
    (":fist_oncoming:" . 128074)
    (":fist_raised:" . 9994)
    (":fist_right:" . 129308)
    (":five:" 53
     (Br . Bl)
     8419)
    (":flags:" . 127887)
    (":flashlight:" . 128294)
    (":fleur_de_lis:" . 9884)
    (":flight_arrival:" . 128748)
    (":flight_departure:" . 128747)
    (":flipper:" . 128044)
    (":floppy_disk:" . 128190)
    (":flower_playing_cards:" . 127924)
    (":flushed:" . 128563)
    (":fog:" . 127787)
    (":foggy:" . 127745)
    (":football:" . 127944)
    (":footprints:" . 128099)
    (":fork_and_knife:" . 127860)
    (":fountain:" . 9970)
    (":fountain_pen:" . 128395)
    (":four:" 52
     (Br . Bl)
     8419)
    (":four_leaf_clover:" . 127808)
    (":fox_face:" . 129418)
    (":fr:" 127467
     (Br . Bl)
     127479)
    (":framed_picture:" . 128444)
    (":free:" . 127379)
    (":french_guiana:" 127468
     (Br . Bl)
     127467)
    (":french_polynesia:" 127477
     (Br . Bl)
     127467)
    (":french_southern_territories:" 127481
     (Br . Bl)
     127467)
    (":fried_egg:" . 127859)
    (":fried_shrimp:" . 127844)
    (":fries:" . 127839)
    (":frog:" . 128056)
    (":frowning:" . 128550)
    (":frowning_face:" . 9785)
    (":frowning_man:" 128589
     (Br . Bl)
     9794)
    (":frowning_woman:" . 128589)
    (":fu:" . 128405)
    (":fuelpump:" . 9981)
    (":full_moon:" . 127765)
    (":full_moon_with_face:" . 127773)
    (":funeral_urn:" . 9905)
    (":gabon:" 127468
     (Br . Bl)
     127462)
    (":gambia:" 127468
     (Br . Bl)
     127474)
    (":game_die:" . 127922)
    (":gb:" 127468
     (Br . Bl)
     127463)
    (":gear:" . 9881)
    (":gem:" . 128142)
    (":gemini:" . 9802)
    (":georgia:" 127468
     (Br . Bl)
     127466)
    (":ghana:" 127468
     (Br . Bl)
     127469)
    (":ghost:" . 128123)
    (":gibraltar:" 127468
     (Br . Bl)
     127470)
    (":gift:" . 127873)
    (":gift_heart:" . 128157)
    (":girl:" . 128103)
    (":globe_with_meridians:" . 127760)
    (":goal_net:" . 129349)
    (":goat:" . 128016)
    (":golf:" . 9971)
    (":golfing_man:" . 127948)
    (":golfing_woman:" 127948
     (Br . Bl)
     9792)
    (":gorilla:" . 129421)
    (":grapes:" . 127815)
    (":greece:" 127468
     (Br . Bl)
     127479)
    (":green_apple:" . 127823)
    (":green_book:" . 128215)
    (":green_heart:" . 128154)
    (":green_salad:" . 129367)
    (":greenland:" 127468
     (Br . Bl)
     127473)
    (":grenada:" 127468
     (Br . Bl)
     127465)
    (":grey_exclamation:" . 10069)
    (":grey_question:" . 10068)
    (":grimacing:" . 128556)
    (":grin:" . 128513)
    (":grinning:" . 128512)
    (":guadeloupe:" 127468
     (Br . Bl)
     127477)
    (":guam:" 127468
     (Br . Bl)
     127482)
    (":guardsman:" . 128130)
    (":guardswoman:" 128130
     (Br . Bl)
     9792)
    (":guatemala:" 127468
     (Br . Bl)
     127481)
    (":guernsey:" 127468
     (Br . Bl)
     127468)
    (":guinea:" 127468
     (Br . Bl)
     127475)
    (":guinea_bissau:" 127468
     (Br . Bl)
     127484)
    (":guitar:" . 127928)
    (":gun:" . 128299)
    (":guyana:" 127468
     (Br . Bl)
     127486)
    (":haircut:" . 128135)
    (":haircut_man:" 128135
     (Br . Bl)
     9794)
    (":haircut_woman:" . 128135)
    (":haiti:" 127469
     (Br . Bl)
     127481)
    (":hamburger:" . 127828)
    (":hammer:" . 128296)
    (":hammer_and_pick:" . 9874)
    (":hammer_and_wrench:" . 128736)
    (":hamster:" . 128057)
    (":hand:" . 9995)
    (":handbag:" . 128092)
    (":handshake:" . 129309)
    (":hankey:" . 128169)
    (":hash:" 35
     (Br . Bl)
     8419)
    (":hatched_chick:" . 128037)
    (":hatching_chick:" . 128035)
    (":headphones:" . 127911)
    (":hear_no_evil:" . 128585)
    (":heart:" . 10084)
    (":heart_decoration:" . 128159)
    (":heart_eyes:" . 128525)
    (":heart_eyes_cat:" . 128571)
    (":heartbeat:" . 128147)
    (":heartpulse:" . 128151)
    (":hearts:" . 9829)
    (":heavy_check_mark:" . 10004)
    (":heavy_division_sign:" . 10135)
    (":heavy_dollar_sign:" . 128178)
    (":heavy_exclamation_mark:" . 10071)
    (":heavy_heart_exclamation:" . 10083)
    (":heavy_minus_sign:" . 10134)
    (":heavy_multiplication_x:" . 10006)
    (":heavy_plus_sign:" . 10133)
    (":helicopter:" . 128641)
    (":herb:" . 127807)
    (":hibiscus:" . 127802)
    (":high_brightness:" . 128262)
    (":high_heel:" . 128096)
    (":hocho:" . 128298)
    (":hole:" . 128371)
    (":honduras:" 127469
     (Br . Bl)
     127475)
    (":honey_pot:" . 127855)
    (":honeybee:" . 128029)
    (":hong_kong:" 127469
     (Br . Bl)
     127472)
    (":horse:" . 128052)
    (":horse_racing:" . 127943)
    (":hospital:" . 127973)
    (":hot_pepper:" . 127798)
    (":hotdog:" . 127789)
    (":hotel:" . 127976)
    (":hotsprings:" . 9832)
    (":hourglass:" . 8987)
    (":hourglass_flowing_sand:" . 9203)
    (":house:" . 127968)
    (":house_with_garden:" . 127969)
    (":houses:" . 127960)
    (":hugs:" . 129303)
    (":hungary:" 127469
     (Br . Bl)
     127482)
    (":hushed:" . 128559)
    (":ice_cream:" . 127848)
    (":ice_hockey:" . 127954)
    (":ice_skate:" . 9976)
    (":icecream:" . 127846)
    (":iceland:" 127470
     (Br . Bl)
     127480)
    (":id:" . 127380)
    (":ideograph_advantage:" . 127568)
    (":imp:" . 128127)
    (":inbox_tray:" . 128229)
    (":incoming_envelope:" . 128232)
    (":india:" 127470
     (Br . Bl)
     127475)
    (":indonesia:" 127470
     (Br . Bl)
     127465)
    (":information_desk_person:" . 128129)
    (":information_source:" . 8505)
    (":innocent:" . 128519)
    (":interrobang:" . 8265)
    (":iphone:" . 128241)
    (":iran:" 127470
     (Br . Bl)
     127479)
    (":iraq:" 127470
     (Br . Bl)
     127478)
    (":ireland:" 127470
     (Br . Bl)
     127466)
    (":isle_of_man:" 127470
     (Br . Bl)
     127474)
    (":israel:" 127470
     (Br . Bl)
     127473)
    (":it:" 127470
     (Br . Bl)
     127481)
    (":izakaya_lantern:" . 127982)
    (":jack_o_lantern:" . 127875)
    (":jamaica:" 127471
     (Br . Bl)
     127474)
    (":japan:" . 128510)
    (":japanese_castle:" . 127983)
    (":japanese_goblin:" . 128122)
    (":japanese_ogre:" . 128121)
    (":jeans:" . 128086)
    (":jersey:" 127471
     (Br . Bl)
     127466)
    (":jordan:" 127471
     (Br . Bl)
     127476)
    (":joy:" . 128514)
    (":joy_cat:" . 128569)
    (":joystick:" . 128377)
    (":jp:" 127471
     (Br . Bl)
     127477)
    (":kaaba:" . 128331)
    (":kazakhstan:" 127472
     (Br . Bl)
     127487)
    (":kenya:" 127472
     (Br . Bl)
     127466)
    (":key:" . 128273)
    (":keyboard:" . 9000)
    (":keycap_ten:" . 128287)
    (":kick_scooter:" . 128756)
    (":kimono:" . 128088)
    (":kiribati:" 127472
     (Br . Bl)
     127470)
    (":kiss:" . 128139)
    (":kissing:" . 128535)
    (":kissing_cat:" . 128573)
    (":kissing_closed_eyes:" . 128538)
    (":kissing_heart:" . 128536)
    (":kissing_smiling_eyes:" . 128537)
    (":kiwi_fruit:" . 129373)
    (":knife:" . 128298)
    (":koala:" . 128040)
    (":koko:" . 127489)
    (":kosovo:" 127485
     (Br . Bl)
     127472)
    (":kr:" 127472
     (Br . Bl)
     127479)
    (":kuwait:" 127472
     (Br . Bl)
     127484)
    (":kyrgyzstan:" 127472
     (Br . Bl)
     127468)
    (":label:" . 127991)
    (":lantern:" . 127982)
    (":laos:" 127473
     (Br . Bl)
     127462)
    (":large_blue_circle:" . 128309)
    (":large_blue_diamond:" . 128311)
    (":large_orange_diamond:" . 128310)
    (":last_quarter_moon:" . 127767)
    (":last_quarter_moon_with_face:" . 127772)
    (":latin_cross:" . 10013)
    (":latvia:" 127473
     (Br . Bl)
     127483)
    (":laughing:" . 128518)
    (":leaves:" . 127811)
    (":lebanon:" 127473
     (Br . Bl)
     127463)
    (":ledger:" . 128210)
    (":left_luggage:" . 128709)
    (":left_right_arrow:" . 8596)
    (":leftwards_arrow_with_hook:" . 8617)
    (":lemon:" . 127819)
    (":leo:" . 9804)
    (":leopard:" . 128006)
    (":lesotho:" 127473
     (Br . Bl)
     127480)
    (":level_slider:" . 127898)
    (":liberia:" 127473
     (Br . Bl)
     127479)
    (":libra:" . 9806)
    (":libya:" 127473
     (Br . Bl)
     127486)
    (":liechtenstein:" 127473
     (Br . Bl)
     127470)
    (":light_rail:" . 128648)
    (":link:" . 128279)
    (":lion:" . 129409)
    (":lips:" . 128068)
    (":lipstick:" . 128132)
    (":lithuania:" 127473
     (Br . Bl)
     127481)
    (":lizard:" . 129422)
    (":lock:" . 128274)
    (":lock_with_ink_pen:" . 128271)
    (":lollipop:" . 127853)
    (":loop:" . 10175)
    (":loud_sound:" . 128266)
    (":loudspeaker:" . 128226)
    (":love_hotel:" . 127977)
    (":love_letter:" . 128140)
    (":low_brightness:" . 128261)
    (":luxembourg:" 127473
     (Br . Bl)
     127482)
    (":lying_face:" . 129317)
    (":m:" . 9410)
    (":macau:" 127474
     (Br . Bl)
     127476)
    (":macedonia:" 127474
     (Br . Bl)
     127472)
    (":madagascar:" 127474
     (Br . Bl)
     127468)
    (":mag:" . 128269)
    (":mag_right:" . 128270)
    (":mahjong:" . 126980)
    (":mailbox:" . 128235)
    (":mailbox_closed:" . 128234)
    (":mailbox_with_mail:" . 128236)
    (":mailbox_with_no_mail:" . 128237)
    (":malawi:" 127474
     (Br . Bl)
     127484)
    (":malaysia:" 127474
     (Br . Bl)
     127486)
    (":maldives:" 127474
     (Br . Bl)
     127483)
    (":male_detective:" . 128373)
    (":mali:" 127474
     (Br . Bl)
     127473)
    (":malta:" 127474
     (Br . Bl)
     127481)
    (":man:" . 128104)
    (":man_artist:" 128104
     (Br . Bl)
     127912)
    (":man_astronaut:" 128104
     (Br . Bl)
     128640)
    (":man_cartwheeling:" 129336
     (Br . Bl)
     9794)
    (":man_cook:" 128104
     (Br . Bl)
     127859)
    (":man_dancing:" . 128378)
    (":man_facepalming:" 129318
     (Br . Bl)
     9794)
    (":man_factory_worker:" 128104
     (Br . Bl)
     127981)
    (":man_farmer:" 128104
     (Br . Bl)
     127806)
    (":man_firefighter:" 128104
     (Br . Bl)
     128658)
    (":man_health_worker:" 128104
     (Br . Bl)
     9877)
    (":man_in_tuxedo:" . 129333)
    (":man_judge:" 128104
     (Br . Bl)
     9878)
    (":man_juggling:" 129337
     (Br . Bl)
     9794)
    (":man_mechanic:" 128104
     (Br . Bl)
     128295)
    (":man_office_worker:" 128104
     (Br . Bl)
     128188)
    (":man_pilot:" 128104
     (Br . Bl)
     9992)
    (":man_playing_handball:" 129342
     (Br . Bl)
     9794)
    (":man_playing_water_polo:" 129341
     (Br . Bl)
     9794)
    (":man_scientist:" 128104
     (Br . Bl)
     128300)
    (":man_shrugging:" 129335
     (Br . Bl)
     9794)
    (":man_singer:" 128104
     (Br . Bl)
     127908)
    (":man_student:" 128104
     (Br . Bl)
     127891)
    (":man_teacher:" 128104
     (Br . Bl)
     127979)
    (":man_technologist:" 128104
     (Br . Bl)
     128187)
    (":man_with_gua_pi_mao:" . 128114)
    (":man_with_turban:" . 128115)
    (":mandarin:" . 127818)
    (":mans_shoe:" . 128094)
    (":mantelpiece_clock:" . 128368)
    (":maple_leaf:" . 127809)
    (":marshall_islands:" 127474
     (Br . Bl)
     127469)
    (":martial_arts_uniform:" . 129355)
    (":martinique:" 127474
     (Br . Bl)
     127478)
    (":mask:" . 128567)
    (":massage:" . 128134)
    (":massage_man:" 128134
     (Br . Bl)
     9794)
    (":massage_woman:" . 128134)
    (":mauritania:" 127474
     (Br . Bl)
     127479)
    (":mauritius:" 127474
     (Br . Bl)
     127482)
    (":mayotte:" 127486
     (Br . Bl)
     127481)
    (":meat_on_bone:" . 127830)
    (":medal_military:" . 127894)
    (":medal_sports:" . 127941)
    (":mega:" . 128227)
    (":melon:" . 127816)
    (":memo:" . 128221)
    (":men_wrestling:" 129340
     (Br . Bl)
     9794)
    (":menorah:" . 128334)
    (":mens:" . 128697)
    (":metal:" . 129304)
    (":metro:" . 128647)
    (":mexico:" 127474
     (Br . Bl)
     127485)
    (":micronesia:" 127467
     (Br . Bl)
     127474)
    (":microphone:" . 127908)
    (":microscope:" . 128300)
    (":middle_finger:" . 128405)
    (":milk_glass:" . 129371)
    (":milky_way:" . 127756)
    (":minibus:" . 128656)
    (":minidisc:" . 128189)
    (":mobile_phone_off:" . 128244)
    (":moldova:" 127474
     (Br . Bl)
     127465)
    (":monaco:" 127474
     (Br . Bl)
     127464)
    (":money_mouth_face:" . 129297)
    (":money_with_wings:" . 128184)
    (":moneybag:" . 128176)
    (":mongolia:" 127474
     (Br . Bl)
     127475)
    (":monkey:" . 128018)
    (":monkey_face:" . 128053)
    (":monorail:" . 128669)
    (":montenegro:" 127474
     (Br . Bl)
     127466)
    (":montserrat:" 127474
     (Br . Bl)
     127480)
    (":moon:" . 127764)
    (":morocco:" 127474
     (Br . Bl)
     127462)
    (":mortar_board:" . 127891)
    (":mosque:" . 128332)
    (":motor_boat:" . 128741)
    (":motor_scooter:" . 128757)
    (":motorcycle:" . 127949)
    (":motorway:" . 128739)
    (":mount_fuji:" . 128507)
    (":mountain:" . 9968)
    (":mountain_bicyclist:" . 128693)
    (":mountain_biking_man:" . 128693)
    (":mountain_biking_woman:" 128693
     (Br . Bl)
     9792)
    (":mountain_cableway:" . 128672)
    (":mountain_railway:" . 128670)
    (":mountain_snow:" . 127956)
    (":mouse:" . 128045)
    (":mouse2:" . 128001)
    (":movie_camera:" . 127909)
    (":moyai:" . 128511)
    (":mozambique:" 127474
     (Br . Bl)
     127487)
    (":mrs_claus:" . 129334)
    (":muscle:" . 128170)
    (":mushroom:" . 127812)
    (":musical_keyboard:" . 127929)
    (":musical_note:" . 127925)
    (":musical_score:" . 127932)
    (":mute:" . 128263)
    (":myanmar:" 127474
     (Br . Bl)
     127474)
    (":nail_care:" . 128133)
    (":name_badge:" . 128219)
    (":namibia:" 127475
     (Br . Bl)
     127462)
    (":national_park:" . 127966)
    (":nauru:" 127475
     (Br . Bl)
     127479)
    (":nauseated_face:" . 129314)
    (":necktie:" . 128084)
    (":negative_squared_cross_mark:" . 10062)
    (":nepal:" 127475
     (Br . Bl)
     127477)
    (":nerd_face:" . 129299)
    (":netherlands:" 127475
     (Br . Bl)
     127473)
    (":neutral_face:" . 128528)
    (":new:" . 127381)
    (":new_caledonia:" 127475
     (Br . Bl)
     127464)
    (":new_moon:" . 127761)
    (":new_moon_with_face:" . 127770)
    (":new_zealand:" 127475
     (Br . Bl)
     127487)
    (":newspaper:" . 128240)
    (":newspaper_roll:" . 128478)
    (":next_track_button:" . 9197)
    (":ng:" . 127382)
    (":ng_man:" 128581
     (Br . Bl)
     9794)
    (":ng_woman:" . 128581)
    (":nicaragua:" 127475
     (Br . Bl)
     127470)
    (":niger:" 127475
     (Br . Bl)
     127466)
    (":nigeria:" 127475
     (Br . Bl)
     127468)
    (":night_with_stars:" . 127747)
    (":nine:" 57
     (Br . Bl)
     8419)
    (":niue:" 127475
     (Br . Bl)
     127482)
    (":no_bell:" . 128277)
    (":no_bicycles:" . 128691)
    (":no_entry:" . 9940)
    (":no_entry_sign:" . 128683)
    (":no_good:" . 128581)
    (":no_good_man:" 128581
     (Br . Bl)
     9794)
    (":no_good_woman:" . 128581)
    (":no_mobile_phones:" . 128245)
    (":no_mouth:" . 128566)
    (":no_pedestrians:" . 128695)
    (":no_smoking:" . 128685)
    (":non-potable_water:" . 128689)
    (":norfolk_island:" 127475
     (Br . Bl)
     127467)
    (":north_korea:" 127472
     (Br . Bl)
     127477)
    (":northern_mariana_islands:" 127474
     (Br . Bl)
     127477)
    (":norway:" 127475
     (Br . Bl)
     127476)
    (":nose:" . 128067)
    (":notebook:" . 128211)
    (":notebook_with_decorative_cover:" . 128212)
    (":notes:" . 127926)
    (":nut_and_bolt:" . 128297)
    (":o:" . 11093)
    (":o2:" . 127358)
    (":ocean:" . 127754)
    (":octopus:" . 128025)
    (":oden:" . 127842)
    (":office:" . 127970)
    (":oil_drum:" . 128738)
    (":ok:" . 127383)
    (":ok_hand:" . 128076)
    (":ok_man:" 128582
     (Br . Bl)
     9794)
    (":ok_woman:" . 128582)
    (":old_key:" . 128477)
    (":older_man:" . 128116)
    (":older_woman:" . 128117)
    (":om:" . 128329)
    (":oman:" 127476
     (Br . Bl)
     127474)
    (":on:" . 128283)
    (":oncoming_automobile:" . 128664)
    (":oncoming_bus:" . 128653)
    (":oncoming_police_car:" . 128660)
    (":oncoming_taxi:" . 128662)
    (":one:" 49
     (Br . Bl)
     8419)
    (":open_book:" . 128214)
    (":open_file_folder:" . 128194)
    (":open_hands:" . 128080)
    (":open_mouth:" . 128558)
    (":open_umbrella:" . 9730)
    (":ophiuchus:" . 9934)
    (":orange:" . 127818)
    (":orange_book:" . 128217)
    (":orthodox_cross:" . 9766)
    (":outbox_tray:" . 128228)
    (":owl:" . 129417)
    (":ox:" . 128002)
    (":package:" . 128230)
    (":page_facing_up:" . 128196)
    (":page_with_curl:" . 128195)
    (":pager:" . 128223)
    (":paintbrush:" . 128396)
    (":pakistan:" 127477
     (Br . Bl)
     127472)
    (":palau:" 127477
     (Br . Bl)
     127484)
    (":palestinian_territories:" 127477
     (Br . Bl)
     127480)
    (":palm_tree:" . 127796)
    (":panama:" 127477
     (Br . Bl)
     127462)
    (":pancakes:" . 129374)
    (":panda_face:" . 128060)
    (":paperclip:" . 128206)
    (":paperclips:" . 128391)
    (":papua_new_guinea:" 127477
     (Br . Bl)
     127468)
    (":paraguay:" 127477
     (Br . Bl)
     127486)
    (":parasol_on_ground:" . 9969)
    (":parking:" . 127359)
    (":part_alternation_mark:" . 12349)
    (":partly_sunny:" . 9925)
    (":passenger_ship:" . 128755)
    (":passport_control:" . 128706)
    (":pause_button:" . 9208)
    (":paw_prints:" . 128062)
    (":peace_symbol:" . 9774)
    (":peach:" . 127825)
    (":peanuts:" . 129372)
    (":pear:" . 127824)
    (":pen:" . 128394)
    (":pencil:" . 128221)
    (":pencil2:" . 9999)
    (":penguin:" . 128039)
    (":pensive:" . 128532)
    (":performing_arts:" . 127917)
    (":persevere:" . 128547)
    (":person_fencing:" . 129338)
    (":person_frowning:" . 128589)
    (":person_with_blond_hair:" . 128113)
    (":person_with_pouting_face:" . 128590)
    (":peru:" 127477
     (Br . Bl)
     127466)
    (":philippines:" 127477
     (Br . Bl)
     127469)
    (":phone:" . 9742)
    (":pick:" . 9935)
    (":pig:" . 128055)
    (":pig2:" . 128022)
    (":pig_nose:" . 128061)
    (":pill:" . 128138)
    (":pineapple:" . 127821)
    (":ping_pong:" . 127955)
    (":pisces:" . 9811)
    (":pitcairn_islands:" 127477
     (Br . Bl)
     127475)
    (":pizza:" . 127829)
    (":place_of_worship:" . 128720)
    (":plate_with_cutlery:" . 127869)
    (":play_or_pause_button:" . 9199)
    (":point_down:" . 128071)
    (":point_left:" . 128072)
    (":point_right:" . 128073)
    (":point_up:" . 9757)
    (":point_up_2:" . 128070)
    (":poland:" 127477
     (Br . Bl)
     127473)
    (":police_car:" . 128659)
    (":policeman:" . 128110)
    (":policewoman:" 128110
     (Br . Bl)
     9792)
    (":poodle:" . 128041)
    (":poop:" . 128169)
    (":popcorn:" . 127871)
    (":portugal:" 127477
     (Br . Bl)
     127481)
    (":post_office:" . 127971)
    (":postal_horn:" . 128239)
    (":postbox:" . 128238)
    (":potable_water:" . 128688)
    (":potato:" . 129364)
    (":pouch:" . 128093)
    (":poultry_leg:" . 127831)
    (":pound:" . 128183)
    (":pout:" . 128545)
    (":pouting_cat:" . 128574)
    (":pouting_man:" 128590
     (Br . Bl)
     9794)
    (":pouting_woman:" . 128590)
    (":pray:" . 128591)
    (":prayer_beads:" . 128255)
    (":pregnant_woman:" . 129328)
    (":previous_track_button:" . 9198)
    (":prince:" . 129332)
    (":princess:" . 128120)
    (":printer:" . 128424)
    (":puerto_rico:" 127477
     (Br . Bl)
     127479)
    (":punch:" . 128074)
    (":purple_heart:" . 128156)
    (":purse:" . 128091)
    (":pushpin:" . 128204)
    (":put_litter_in_its_place:" . 128686)
    (":qatar:" 127478
     (Br . Bl)
     127462)
    (":question:" . 10067)
    (":rabbit:" . 128048)
    (":rabbit2:" . 128007)
    (":racehorse:" . 128014)
    (":racing_car:" . 127950)
    (":radio:" . 128251)
    (":radio_button:" . 128280)
    (":radioactive:" . 9762)
    (":rage:" . 128545)
    (":railway_car:" . 128643)
    (":railway_track:" . 128740)
    (":rainbow:" . 127752)
    (":rainbow_flag:" 127987
     (Br . Bl)
     127752)
    (":raised_back_of_hand:" . 129306)
    (":raised_hand:" . 9995)
    (":raised_hand_with_fingers_splayed:" . 128400)
    (":raised_hands:" . 128588)
    (":raising_hand:" . 128587)
    (":raising_hand_man:" 128587
     (Br . Bl)
     9794)
    (":raising_hand_woman:" . 128587)
    (":ram:" . 128015)
    (":ramen:" . 127836)
    (":rat:" . 128000)
    (":record_button:" . 9210)
    (":recycle:" . 9851)
    (":red_car:" . 128663)
    (":red_circle:" . 128308)
    (":registered:" . 174)
    (":relaxed:" . 9786)
    (":relieved:" . 128524)
    (":reminder_ribbon:" . 127895)
    (":repeat:" . 128257)
    (":repeat_one:" . 128258)
    (":rescue_worker_helmet:" . 9937)
    (":restroom:" . 128699)
    (":reunion:" 127479
     (Br . Bl)
     127466)
    (":revolving_hearts:" . 128158)
    (":rewind:" . 9194)
    (":rhinoceros:" . 129423)
    (":ribbon:" . 127872)
    (":rice:" . 127834)
    (":rice_ball:" . 127833)
    (":rice_cracker:" . 127832)
    (":rice_scene:" . 127889)
    (":right_anger_bubble:" . 128495)
    (":ring:" . 128141)
    (":robot:" . 129302)
    (":rocket:" . 128640)
    (":rofl:" . 129315)
    (":roll_eyes:" . 128580)
    (":roller_coaster:" . 127906)
    (":romania:" 127479
     (Br . Bl)
     127476)
    (":rooster:" . 128019)
    (":rose:" . 127801)
    (":rosette:" . 127989)
    (":rotating_light:" . 128680)
    (":round_pushpin:" . 128205)
    (":rowboat:" . 128675)
    (":rowing_man:" . 128675)
    (":rowing_woman:" 128675
     (Br . Bl)
     9792)
    (":ru:" 127479
     (Br . Bl)
     127482)
    (":rugby_football:" . 127945)
    (":runner:" . 127939)
    (":running:" . 127939)
    (":running_man:" . 127939)
    (":running_shirt_with_sash:" . 127933)
    (":running_woman:" 127939
     (Br . Bl)
     9792)
    (":rwanda:" 127479
     (Br . Bl)
     127484)
    (":sa:" . 127490)
    (":sagittarius:" . 9808)
    (":sailboat:" . 9973)
    (":sake:" . 127862)
    (":samoa:" 127484
     (Br . Bl)
     127480)
    (":san_marino:" 127480
     (Br . Bl)
     127474)
    (":sandal:" . 128097)
    (":santa:" . 127877)
    (":sao_tome_principe:" 127480
     (Br . Bl)
     127481)
    (":sassy_man:" 128129
     (Br . Bl)
     9794)
    (":sassy_woman:" . 128129)
    (":satellite:" . 128225)
    (":satisfied:" . 128518)
    (":saudi_arabia:" 127480
     (Br . Bl)
     127462)
    (":saxophone:" . 127927)
    (":school:" . 127979)
    (":school_satchel:" . 127890)
    (":scissors:" . 9986)
    (":scorpion:" . 129410)
    (":scorpius:" . 9807)
    (":scream:" . 128561)
    (":scream_cat:" . 128576)
    (":scroll:" . 128220)
    (":seat:" . 128186)
    (":secret:" . 12953)
    (":see_no_evil:" . 128584)
    (":seedling:" . 127793)
    (":selfie:" . 129331)
    (":senegal:" 127480
     (Br . Bl)
     127475)
    (":serbia:" 127479
     (Br . Bl)
     127480)
    (":seven:" 55
     (Br . Bl)
     8419)
    (":seychelles:" 127480
     (Br . Bl)
     127464)
    (":shallow_pan_of_food:" . 129368)
    (":shamrock:" . 9752)
    (":shark:" . 129416)
    (":shaved_ice:" . 127847)
    (":sheep:" . 128017)
    (":shell:" . 128026)
    (":shield:" . 128737)
    (":shinto_shrine:" . 9961)
    (":ship:" . 128674)
    (":shirt:" . 128085)
    (":shit:" . 128169)
    (":shoe:" . 128094)
    (":shopping:" . 128717)
    (":shopping_cart:" . 128722)
    (":shower:" . 128703)
    (":shrimp:" . 129424)
    (":sierra_leone:" 127480
     (Br . Bl)
     127473)
    (":signal_strength:" . 128246)
    (":singapore:" 127480
     (Br . Bl)
     127468)
    (":sint_maarten:" 127480
     (Br . Bl)
     127485)
    (":six:" 54
     (Br . Bl)
     8419)
    (":six_pointed_star:" . 128303)
    (":ski:" . 127935)
    (":skier:" . 9975)
    (":skull:" . 128128)
    (":skull_and_crossbones:" . 9760)
    (":sleeping:" . 128564)
    (":sleeping_bed:" . 128716)
    (":sleepy:" . 128554)
    (":slightly_frowning_face:" . 128577)
    (":slightly_smiling_face:" . 128578)
    (":slot_machine:" . 127920)
    (":slovakia:" 127480
     (Br . Bl)
     127472)
    (":slovenia:" 127480
     (Br . Bl)
     127470)
    (":small_airplane:" . 128745)
    (":small_blue_diamond:" . 128313)
    (":small_orange_diamond:" . 128312)
    (":small_red_triangle:" . 128314)
    (":small_red_triangle_down:" . 128315)
    (":smile:" . 128516)
    (":smile_cat:" . 128568)
    (":smiley:" . 128515)
    (":smiley_cat:" . 128570)
    (":smiling_imp:" . 128520)
    (":smirk:" . 128527)
    (":smirk_cat:" . 128572)
    (":smoking:" . 128684)
    (":snail:" . 128012)
    (":snake:" . 128013)
    (":sneezing_face:" . 129319)
    (":snowboarder:" . 127938)
    (":snowflake:" . 10052)
    (":snowman:" . 9924)
    (":snowman_with_snow:" . 9731)
    (":sob:" . 128557)
    (":soccer:" . 9917)
    (":solomon_islands:" 127480
     (Br . Bl)
     127463)
    (":somalia:" 127480
     (Br . Bl)
     127476)
    (":soon:" . 128284)
    (":sos:" . 127384)
    (":sound:" . 128265)
    (":south_africa:" 127487
     (Br . Bl)
     127462)
    (":south_georgia_south_sandwich_islands:" 127468
     (Br . Bl)
     127480)
    (":south_sudan:" 127480
     (Br . Bl)
     127480)
    (":space_invader:" . 128126)
    (":spades:" . 9824)
    (":spaghetti:" . 127837)
    (":sparkle:" . 10055)
    (":sparkler:" . 127879)
    (":sparkles:" . 10024)
    (":sparkling_heart:" . 128150)
    (":speak_no_evil:" . 128586)
    (":speaker:" . 128264)
    (":speaking_head:" . 128483)
    (":speech_balloon:" . 128172)
    (":speedboat:" . 128676)
    (":spider:" . 128375)
    (":spider_web:" . 128376)
    (":spiral_calendar:" . 128467)
    (":spiral_notepad:" . 128466)
    (":spoon:" . 129348)
    (":squid:" . 129425)
    (":sri_lanka:" 127473
     (Br . Bl)
     127472)
    (":st_barthelemy:" 127463
     (Br . Bl)
     127473)
    (":st_helena:" 127480
     (Br . Bl)
     127469)
    (":st_kitts_nevis:" 127472
     (Br . Bl)
     127475)
    (":st_lucia:" 127473
     (Br . Bl)
     127464)
    (":st_pierre_miquelon:" 127477
     (Br . Bl)
     127474)
    (":st_vincent_grenadines:" 127483
     (Br . Bl)
     127464)
    (":stadium:" . 127967)
    (":star:" . 11088)
    (":star2:" . 127775)
    (":star_and_crescent:" . 9770)
    (":star_of_david:" . 10017)
    (":stars:" . 127776)
    (":station:" . 128649)
    (":statue_of_liberty:" . 128509)
    (":steam_locomotive:" . 128642)
    (":stew:" . 127858)
    (":stop_button:" . 9209)
    (":stop_sign:" . 128721)
    (":stopwatch:" . 9201)
    (":straight_ruler:" . 128207)
    (":strawberry:" . 127827)
    (":stuck_out_tongue:" . 128539)
    (":stuck_out_tongue_closed_eyes:" . 128541)
    (":stuck_out_tongue_winking_eye:" . 128540)
    (":studio_microphone:" . 127897)
    (":stuffed_flatbread:" . 129369)
    (":sudan:" 127480
     (Br . Bl)
     127465)
    (":sun_behind_large_cloud:" . 127781)
    (":sun_behind_rain_cloud:" . 127782)
    (":sun_behind_small_cloud:" . 127780)
    (":sun_with_face:" . 127774)
    (":sunflower:" . 127803)
    (":sunglasses:" . 128526)
    (":sunny:" . 9728)
    (":sunrise:" . 127749)
    (":sunrise_over_mountains:" . 127748)
    (":surfer:" . 127940)
    (":surfing_man:" . 127940)
    (":surfing_woman:" 127940
     (Br . Bl)
     9792)
    (":suriname:" 127480
     (Br . Bl)
     127479)
    (":sushi:" . 127843)
    (":suspension_railway:" . 128671)
    (":swaziland:" 127480
     (Br . Bl)
     127487)
    (":sweat:" . 128531)
    (":sweat_drops:" . 128166)
    (":sweat_smile:" . 128517)
    (":sweden:" 127480
     (Br . Bl)
     127466)
    (":sweet_potato:" . 127840)
    (":swimmer:" . 127946)
    (":swimming_man:" . 127946)
    (":swimming_woman:" 127946
     (Br . Bl)
     9792)
    (":switzerland:" 127464
     (Br . Bl)
     127469)
    (":symbols:" . 128291)
    (":synagogue:" . 128333)
    (":syria:" 127480
     (Br . Bl)
     127486)
    (":syringe:" . 128137)
    (":taco:" . 127790)
    (":tada:" . 127881)
    (":taiwan:" 127481
     (Br . Bl)
     127484)
    (":tajikistan:" 127481
     (Br . Bl)
     127471)
    (":tanabata_tree:" . 127883)
    (":tangerine:" . 127818)
    (":tanzania:" 127481
     (Br . Bl)
     127487)
    (":taurus:" . 9801)
    (":taxi:" . 128661)
    (":tea:" . 127861)
    (":telephone:" . 9742)
    (":telephone_receiver:" . 128222)
    (":telescope:" . 128301)
    (":tennis:" . 127934)
    (":tent:" . 9978)
    (":thailand:" 127481
     (Br . Bl)
     127469)
    (":thermometer:" . 127777)
    (":thinking:" . 129300)
    (":thought_balloon:" . 128173)
    (":three:" 51
     (Br . Bl)
     8419)
    (":thumbsdown:" . 128078)
    (":thumbsup:" . 128077)
    (":ticket:" . 127915)
    (":tickets:" . 127903)
    (":tiger:" . 128047)
    (":tiger2:" . 128005)
    (":timer_clock:" . 9202)
    (":timor_leste:" 127481
     (Br . Bl)
     127473)
    (":tipping_hand_man:" 128129
     (Br . Bl)
     9794)
    (":tipping_hand_woman:" . 128129)
    (":tired_face:" . 128555)
    (":tm:" . 8482)
    (":togo:" 127481
     (Br . Bl)
     127468)
    (":toilet:" . 128701)
    (":tokelau:" 127481
     (Br . Bl)
     127472)
    (":tokyo_tower:" . 128508)
    (":tomato:" . 127813)
    (":tonga:" 127481
     (Br . Bl)
     127476)
    (":tongue:" . 128069)
    (":top:" . 128285)
    (":tophat:" . 127913)
    (":tornado:" . 127786)
    (":tr:" 127481
     (Br . Bl)
     127479)
    (":trackball:" . 128434)
    (":tractor:" . 128668)
    (":traffic_light:" . 128677)
    (":train:" . 128651)
    (":train2:" . 128646)
    (":tram:" . 128650)
    (":triangular_flag_on_post:" . 128681)
    (":triangular_ruler:" . 128208)
    (":trident:" . 128305)
    (":trinidad_tobago:" 127481
     (Br . Bl)
     127481)
    (":triumph:" . 128548)
    (":trolleybus:" . 128654)
    (":trophy:" . 127942)
    (":tropical_drink:" . 127865)
    (":tropical_fish:" . 128032)
    (":truck:" . 128666)
    (":trumpet:" . 127930)
    (":tshirt:" . 128085)
    (":tulip:" . 127799)
    (":tumbler_glass:" . 129347)
    (":tunisia:" 127481
     (Br . Bl)
     127475)
    (":turkey:" . 129411)
    (":turkmenistan:" 127481
     (Br . Bl)
     127474)
    (":turks_caicos_islands:" 127481
     (Br . Bl)
     127464)
    (":turtle:" . 128034)
    (":tuvalu:" 127481
     (Br . Bl)
     127483)
    (":tv:" . 128250)
    (":twisted_rightwards_arrows:" . 128256)
    (":two:" 50
     (Br . Bl)
     8419)
    (":two_hearts:" . 128149)
    (":two_men_holding_hands:" . 128108)
    (":two_women_holding_hands:" . 128109)
    (":u5272:" . 127545)
    (":u5408:" . 127540)
    (":u55b6:" . 127546)
    (":u6307:" . 127535)
    (":u6708:" . 127543)
    (":u6709:" . 127542)
    (":u6e80:" . 127541)
    (":u7121:" . 127514)
    (":u7533:" . 127544)
    (":u7981:" . 127538)
    (":u7a7a:" . 127539)
    (":uganda:" 127482
     (Br . Bl)
     127468)
    (":uk:" 127468
     (Br . Bl)
     127463)
    (":ukraine:" 127482
     (Br . Bl)
     127462)
    (":umbrella:" . 9748)
    (":unamused:" . 128530)
    (":underage:" . 128286)
    (":unicorn:" . 129412)
    (":united_arab_emirates:" 127462
     (Br . Bl)
     127466)
    (":unlock:" . 128275)
    (":up:" . 127385)
    (":upside_down_face:" . 128579)
    (":uruguay:" 127482
     (Br . Bl)
     127486)
    (":us:" 127482
     (Br . Bl)
     127480)
    (":us_virgin_islands:" 127483
     (Br . Bl)
     127470)
    (":uzbekistan:" 127482
     (Br . Bl)
     127487)
    (":v:" . 9996)
    (":vanuatu:" 127483
     (Br . Bl)
     127482)
    (":vatican_city:" 127483
     (Br . Bl)
     127462)
    (":venezuela:" 127483
     (Br . Bl)
     127466)
    (":vertical_traffic_light:" . 128678)
    (":vhs:" . 128252)
    (":vibration_mode:" . 128243)
    (":video_camera:" . 128249)
    (":video_game:" . 127918)
    (":vietnam:" 127483
     (Br . Bl)
     127475)
    (":violin:" . 127931)
    (":virgo:" . 9805)
    (":volcano:" . 127755)
    (":volleyball:" . 127952)
    (":vs:" . 127386)
    (":vulcan_salute:" . 128406)
    (":walking:" . 128694)
    (":walking_man:" . 128694)
    (":walking_woman:" 128694
     (Br . Bl)
     9792)
    (":wallis_futuna:" 127484
     (Br . Bl)
     127467)
    (":waning_crescent_moon:" . 127768)
    (":waning_gibbous_moon:" . 127766)
    (":warning:" . 9888)
    (":wastebasket:" . 128465)
    (":watch:" . 8986)
    (":water_buffalo:" . 128003)
    (":watermelon:" . 127817)
    (":wave:" . 128075)
    (":wavy_dash:" . 12336)
    (":waxing_crescent_moon:" . 127762)
    (":waxing_gibbous_moon:" . 127764)
    (":wc:" . 128702)
    (":weary:" . 128553)
    (":wedding:" . 128146)
    (":weight_lifting_man:" . 127947)
    (":weight_lifting_woman:" 127947
     (Br . Bl)
     9792)
    (":western_sahara:" 127466
     (Br . Bl)
     127469)
    (":whale:" . 128051)
    (":whale2:" . 128011)
    (":wheel_of_dharma:" . 9784)
    (":wheelchair:" . 9855)
    (":white_check_mark:" . 9989)
    (":white_circle:" . 9898)
    (":white_flag:" . 127987)
    (":white_flower:" . 128174)
    (":white_large_square:" . 11036)
    (":white_medium_small_square:" . 9725)
    (":white_medium_square:" . 9723)
    (":white_small_square:" . 9643)
    (":white_square_button:" . 128307)
    (":wilted_flower:" . 129344)
    (":wind_chime:" . 127888)
    (":wind_face:" . 127788)
    (":wine_glass:" . 127863)
    (":wink:" . 128521)
    (":wolf:" . 128058)
    (":woman:" . 128105)
    (":woman_artist:" 128105
     (Br . Bl)
     127912)
    (":woman_astronaut:" 128105
     (Br . Bl)
     128640)
    (":woman_cartwheeling:" 129336
     (Br . Bl)
     9792)
    (":woman_cook:" 128105
     (Br . Bl)
     127859)
    (":woman_facepalming:" 129318
     (Br . Bl)
     9792)
    (":woman_factory_worker:" 128105
     (Br . Bl)
     127981)
    (":woman_farmer:" 128105
     (Br . Bl)
     127806)
    (":woman_firefighter:" 128105
     (Br . Bl)
     128658)
    (":woman_health_worker:" 128105
     (Br . Bl)
     9877)
    (":woman_judge:" 128105
     (Br . Bl)
     9878)
    (":woman_juggling:" 129337
     (Br . Bl)
     9792)
    (":woman_mechanic:" 128105
     (Br . Bl)
     128295)
    (":woman_office_worker:" 128105
     (Br . Bl)
     128188)
    (":woman_pilot:" 128105
     (Br . Bl)
     9992)
    (":woman_playing_handball:" 129342
     (Br . Bl)
     9792)
    (":woman_playing_water_polo:" 129341
     (Br . Bl)
     9792)
    (":woman_scientist:" 128105
     (Br . Bl)
     128300)
    (":woman_shrugging:" 129335
     (Br . Bl)
     9792)
    (":woman_singer:" 128105
     (Br . Bl)
     127908)
    (":woman_student:" 128105
     (Br . Bl)
     127891)
    (":woman_teacher:" 128105
     (Br . Bl)
     127979)
    (":woman_technologist:" 128105
     (Br . Bl)
     128187)
    (":woman_with_turban:" 128115
     (Br . Bl)
     9792)
    (":womans_clothes:" . 128090)
    (":womans_hat:" . 128082)
    (":women_wrestling:" 129340
     (Br . Bl)
     9792)
    (":womens:" . 128698)
    (":world_map:" . 128506)
    (":worried:" . 128543)
    (":wrench:" . 128295)
    (":writing_hand:" . 9997)
    (":x:" . 10060)
    (":yellow_heart:" . 128155)
    (":yemen:" 127486
     (Br . Bl)
     127466)
    (":yen:" . 128180)
    (":yin_yang:" . 9775)
    (":yum:" . 128523)
    (":zambia:" 127487
     (Br . Bl)
     127474)
    (":zap:" . 9889)
    (":zero:" 48
     (Br . Bl)
     8419)
    (":zimbabwe:" 127487
     (Br . Bl)
     127484)
    (":zipper_mouth_face:" . 129296)
    (":zzz:" . 128164))
   #+end_example
